Revit 2026 API

# IExternalEventHandler Interface

---

An interface to be executed when an external event is raised.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public interface IExternalEventHandler
```
```vb
Public Interface IExternalEventHandler
```
```cpp
public interface class IExternalEventHandler
```
```fsharp
type IExternalEventHandler = interface end
```

The IExternalEventHandler type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Execute | This method is called to handle the external event. |
|  | GetName | String identification of the event handler. |

An instance of a class implementing this interface will be registered with Revit first, and every time the corresponding external event is raised, the Execute method of this interface will be invoked.

#### Reference

Autodesk.Revit.UI Namespace